In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv('chicago.csv')
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [3]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [5]:
chicago['Department'].nunique()

35

In [4]:
chicago.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [7]:
chicago['Department'] = chicago['Department'].astype('category')

In [8]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.2+ KB

# Common String Methods - .lower() | .upper() | .title() | .len()

In [19]:
chicago = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [20]:
# Para evocar um método para manipulação de string no Df é necessario a utilização do sufixo .str
chicago['Name'].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32057    zygadlo,  michael j
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
Name: Name, Length: 32062, dtype: object

In [21]:
chicago['Name'] = chicago['Name'].str.title()
chicago['Position Title'] = chicago['Position Title'].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  Water Rate Taker  WATER MGMNT              $90744.00
1  Aaron,  Jeffery M    Police Officer       POLICE              $84450.00
2     Aaron,  Karina    Police Officer       POLICE              $84450.00

In [22]:
chicago['Department'].str.len()

0        11
1         6
2         6
3        16
4        11
         ..
32057    16
32058     6
32059     6
32060     6
32061     4
Name: Department, Length: 32062, dtype: int64

# The .str.replace() Method

In [23]:
'Hello World'.replace('l', '!')

'He!!o Wor!d'

In [27]:
chicago['Department'] = chicago['Department'].str.replace('MGMNT', 'MANAGEMENT')
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,$90744.00
1,"Aaron, Jeffery M",Police Officer,POLICE,$84450.00
2,"Aaron, Karina",Police Officer,POLICE,$84450.00

In [30]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$','').astype(float)

<ipython-input-30-4d8c77f68965>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$','').astype(float)

In [48]:
chicago['Employee Annual Salary'].sum()
chicago['Employee Annual Salary'].mean()
chicago['Employee Annual Salary'].mode()
chicago['Employee Annual Salary'].median()
chicago['Employee Annual Salary'].std() #Standard Deviation (Desvio Padrão)
chicago['Employee Annual Salary'].nlargest(10)
chicago['Employee Annual Salary'].nsmallest(10)

15102       0.96
12       2756.00
27       2756.00
47       2756.00
295      2756.00
380      2756.00
686      2756.00
751      2756.00
959      2756.00
1093     2756.00
Name: Employee Annual Salary, dtype: float64

In [51]:
chicago.iloc[15102]

Name                                 Koch,  Steven
Position Title            Administrative Secretary
Department                          MAYOR'S OFFICE
Employee Annual Salary                        0.96
Name: 15102, dtype: object

# Filtering with String Methods

In [53]:
mask = chicago['Position Title'].str.lower().str.contains('water')
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
554,"Aluise, Vincent G",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
671,"Ander, Perry A",Water Chemist Ii,WATER MANAGEMENT,82044.0
685,"Anderson, Andrew J",District Superintendent Of Water Distribution,WATER MANAGEMENT,109272.0
702,"Anderson, Donald",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
...,...,...,...,...
29669,"Verma, Anupam",Managing Engineer - Water Management,WATER MANAGEMENT,111192.0
30239,"Washington, Joseph",Water Chemist Iii,WATER MANAGEMENT,89676.0
30544,"West, Thomas R",Gen Supt Of Water Management,WATER MANAGEMENT,115704.0
30991,"Williams, Matthew",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0
31405,"Woodridge, Robert L",Foreman Of Water Pipe Construction,WATER MANAGEMENT,102440.0

In [54]:
mask1 = chicago['Position Title'].str.lower().str.startswith('water')
chicago[mask1]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
671,"Ander, Perry A",Water Chemist Ii,WATER MANAGEMENT,82044.0
1054,"Ashley, Karma T",Water Chemist Ii,WATER MANAGEMENT,82044.0
1079,"Atkins, Joanna M",Water Chemist Ii,WATER MANAGEMENT,82044.0
1181,"Azeem, Mohammed A",Water Chemist Ii,WATER MANAGEMENT,53172.0
...,...,...,...,...
28574,"Threatt, Denise R",Water Quality Inspector,WATER MANAGEMENT,62004.0
28602,"Tignor, Darryl B",Water Rate Taker,WATER MANAGEMENT,78948.0
28955,"Travis Cook, Leslie R",Water Rate Taker,WATER MANAGEMENT,78948.0
29584,"Velazquez, John",Water Rate Taker,WATER MANAGEMENT,78948.0
30239,"Washington, Joseph",Water Chemist Iii,WATER MANAGEMENT,89676.0

In [56]:
chicago[chicago['Position Title'].str.lower().str.endswith('ist')]

,Name,Position Title,Department,Employee Annual Salary
184,"Afroz, Nayyar",Psychiatrist,HEALTH,99840.0
308,"Alarcon, Luis J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,81948.0
422,"Allain, Carolyn",Senior Telecommunications Specialist,DoIT,89880.0
472,"Allen, Robert",Machinist,WATER MANAGEMENT,94328.0
705,"Anderson, Edward M",Sr Procurement Specialist,PROCUREMENT,91476.0
...,...,...,...,...
31667,"Yoder, Teresa G",Archival Specialist,PUBLIC LIBRARY,74304.0
31688,"Youngbloom, Laurence G",Crimes Surveillance Specialist,OEMC,19676.8
31717,"Young, Kimberly M",Sr Procurement Specialist,PROCUREMENT,68556.0
31837,"Zapata, Hugo",Sr Procurement Specialist,PROCUREMENT,87324.0
31918,"Zemke, Richard P",Machinist,AVIATION,94328.0

# More String Methods - .strip() , .lstrip() , .rstrip()

In [57]:
'          Hello World          '.lstrip()

'Hello World          '

In [58]:
'          Hello World          '.rstrip()

'          Hello World'

In [59]:
'          Hello World          '.strip()

'Hello World'

In [61]:
chicago['Name'] = chicago['Name'].str.rstrip().str.lstrip()

In [63]:
chicago['Position Title'] = chicago['Position Title'].str.strip()

# String Methods on Index and Columns

In [65]:
chicago1 = pd.read_csv('chicago.csv', index_col='Name').dropna(how = 'all')
chicago1['Department'] = chicago1['Department'].astype('category')
chicago1.tail(3)

                              Position Title Department Employee Annual Salary
Name
ZYMANTAS,  MARK E             POLICE OFFICER     POLICE              $84450.00
ZYRKOWSKI,  CARLO E           POLICE OFFICER     POLICE              $87384.00
ZYSKOWSKI,  DARIUSZ  CHIEF DATA BASE ANALYST       DoIT             $113664.00

In [68]:
chicago1.index = chicago1.index.str.strip().str.title()
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
1,"Aaron, Jeffery M",Police Officer,POLICE,84450.0
2,"Aaron, Karina",Police Officer,POLICE,84450.0

In [70]:
chicago1.columns = chicago1.columns.str.upper()

In [72]:
chicago1.head(3)

                     POSITION TITLE   DEPARTMENT EMPLOYEE ANNUAL SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

# Split Strings by Characters with .str.split() Method

In [79]:
'Hello my name is Boris'.split(' ')

['Hello', 'my', 'name', 'is', 'Boris']

In [87]:
chicago['Name'].str.split(',').str.get(0).str.title().value_counts()

Williams      293
Johnson       244
Smith         241
Brown         185
Jones         183
             ...
Talpos          1
Hubbird         1
Elarde          1
Bakopoulos      1
Ferreira        1
Name: Name, Length: 13829, dtype: int64

In [90]:
chicago['Position Title'].str.split(' ').str.get(0).value_counts()

Police              10856
Firefighter-Emt      1509
Sergeant             1186
Pool                  918
Firefighter           810
                    ...
Offset                  1
Superintendent'S        1
Equal                   1
Volunteer               1
Analyst                 1
Name: Position Title, Length: 320, dtype: int64

# More Practice with Splits

In [147]:
chicago1 = pd.read_csv('chicago.csv').dropna(how = 'all')
chicago1['Department'] = chicago1['Department'].astype('category')
chicago1.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [148]:
chicago1['Name'].str.split(',').str.get(-1).str.strip().str.split(' ').str.get(0).value_counts().nlargest(5)

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

In [149]:
chicago1['Name'].str.split(', ').str.get(-1).str.strip().str.split(' ').str.get(0).value_counts().nlargest(5)

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

# The expand and the n Paramaters of the str.split() Method

In [150]:
chicago1[['First Name', 'Last Name']] = chicago1['Name'].str.split(',' , expand = True)
chicago1.columns = ['First Name', 'Last Name', 'Name', 'Position Title', 'Department', 'Employee Annual Salary']

In [160]:
chicago1.drop(columns = 'Name', inplace = True)

In [161]:
chicago1.head()

,First Name,Last Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,$106836.00,ABAD JR,VICENTE M

In [119]:
chicago1['Position Title'].str.split(' ', expand = True)

,0,1,2,3,4,5,6,7,8
0,WATER,RATE,TAKER,None,None,None,None,None,None
1,POLICE,OFFICER,None,None,None,None,None,None,None
2,POLICE,OFFICER,None,None,None,None,None,None,None
3,CHIEF,CONTRACT,EXPEDITER,None,None,None,None,None,None
4,CIVIL,ENGINEER,IV,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...
32057,FRM,OF,MACHINISTS,-,AUTOMOTIVE,None,None,None,None
32058,POLICE,OFFICER,None,None,None,None,None,None,None
32059,POLICE,OFFICER,None,None,None,None,None,None,None
32060,POLICE,OFFICER,None,None,None,None,None,None,None
32061,CHIEF,DATA,BASE,ANALYST,None,None,None,None,None

In [121]:
chicago1['Position Title'].str.split(' ', expand = True, n = 1) #the n argument reffers to the number of splits

            0                           1
0       WATER                  RATE TAKER
1      POLICE                     OFFICER
2      POLICE                     OFFICER
3       CHIEF          CONTRACT EXPEDITER
4       CIVIL                 ENGINEER IV
...       ...                         ...
32057     FRM  OF MACHINISTS - AUTOMOTIVE
32058  POLICE                     OFFICER
32059  POLICE                     OFFICER
32060  POLICE                     OFFICER
32061   CHIEF           DATA BASE ANALYST

[32062 rows x 2 columns]